{
  "career": [
    {
      "name": "Meta",
      "href": "https://www.meta.com/",
      "title": "Data Analyst (Contract via Tundra)",
      "logo": "/companies/meta.png",
      "start": "September 2025",
      "end": "Current",
      "description": [
        "Led end to end labeling and audit workstreams that improved annotation accuracy by about 15% and directly strengthened AI model reliability for global user facing products.",
        "Strengthened quality operations by analyzing error patterns, producing actionable insights and driving workflow changes that cut repeat labeling issues by an estimated 20%.",
        "Resolved cross team operational blockers by coordinating with engineering, policy and vendor partners which reduced turnaround times for tooling fixes and guideline updates by roughly 30%.",
        "Enhanced LLaMA and Business Messaging AI performance by designing evaluation rubrics, building targeted prompt tests and validating datasets which helped raise model alignment and response quality across multiple regions."
      ]
    },
    {
      "name": "ING Bank",
      "href": "https://www.ing.com/",
      "title": "PEGA Engineer",
      "logo": "/companies/ing.png",
      "start": "Oct 2021",
      "end": "Nov 2023",
      "description": [
        "Accelerated production issue resolution by designing and implementing a custom PEGA DX API application, reducing response time by 90% and improving system reliability.",
        "Automated over 200 regression tests using Playwright and Selenium, reducing production defects by 35% and enhancing software quality.",
        "Managed deployments across development, staging, and production environments using Microsoft Azure, ensuring seamless releases every sprint with 100% uptime.",
        "Optimized system performance through API integrations and workflow enhancements, improving operational efficiency by 20% and reducing manual intervention in core banking processes."
      ]
    },
    {
      "name": "Freelance",
      "href": "",
      "title": "Web Developer",
      "logo": "/companies/freelance.png",
      "start": "Sept 2018",
      "end": "Nov 2023",
      "description": [
        "Developed 15+ custom websites using WordPress and Shopify, increasing client online visibility and driving an average 30% boost in customer engagement.",
        "Implemented SEO-optimized strategies and integrated C# .NET backends with SQL Server, resulting in a 25% increase in online sales for e-commerce clients.",
        "Integrated REST APIs and geo-tagging features on multiple websites, enhancing user interactivity and improving session duration by 20%.",
        "Redesigned client websites with responsive layouts and modern UI, reducing bounce rates by 18% and improving mobile user experience."
      ]
    },
    {
      "name": "Foods On The Go Corporation",
      "href": "",
      "title": "Operations Manager (Consultant)",
      "logo": "/companies/fotg.png",
      "start": "Aug 2020",
      "end": "May 2021",
      "description": [
        "Negotiated supplier deals, improving raw material acquisition and lowering costs.",
        "Streamlined day-to-day operations and improved team coordination for more efficiency."
      ]
    },
    {
      "name": "Make It Happen Multimedia Production",
      "href": "",
      "title": "Web Developer (Intern)",
      "logo": "/companies/mih.png",
      "start": "Nov 2019",
      "end": "Aug 2020",
      "description": [
        "Designed a booking inquiry website that boosted client engagement by 30%.",
        "Enhanced social media presence, increasing engagement by around 30%."
      ]
    },
    {
      "name": "Life Enrichment Inc.",
      "href": "",
      "title": "IT Consultant",
      "logo": "/companies/life.png",
      "start": "Nov 2018",
      "end": "Nov 2019",
      "description": [
        "Developed a client booking website, resulting in 25% more appointments.",
        "Migrated records to a digital system, automating data management."
      ]
    }
  ]
}